{
	"version": "https://jsonfeed.org/version/1",
	"title": "Tyler Knows Nothing",
	"icon": "https://micro.blog/tylerknowsnothing/avatar.jpg",
	"home_page_url": "https://tylerknowsnothing.com/",
	"feed_url": "https://tylerknowsnothing.com/feed.json",
	"items": [
		
			{
				"id": "http://tknblogs.micro.blog/2024/09/01/watchmen-chapter-i.html",
				"title": "Watchmen Chapter I, a review",
				"content_html": "<p><img src=\"https://tknblogs.micro.blog/uploads/2024/watchmen-chapter-1-v1-fmjpg-ux10002172404626.jpg\" alt=\"Series art for Chapter I featuring (Left to Right) The Comedian, Dr. Manhattan, Ozymandius, Rorschach, Silk Spectre II, and Nite Owl II.\"></p>\n<p>What can I say about <em>Watchmen</em> that hasn&rsquo;t already been said&hellip; is what I would say if DC hadn&rsquo;t just released the first part of an animated two part adaptation of what is considered one of the finest comic books of all time. But let&rsquo;s talk about the comic book first.</p>\n<p>Released as a 12-issue limited series in 1986 and rendered into a trade paperback combining all twelve issues in 1987, the creation of writer Alan Moore, artist Dave Gibbons, and colored by John Higgins, <em>Watchmen</em> was a critical and commercial success and has remained so since its release. It would win a <a href=\"https://www.thehugoawards.org/hugo-history/1988-hugo-awards/\">Hugo Award in 1988</a> and be added to <a href=\"https://entertainment.time.com/2005/10/16/all-time-100-novels/slide/all/\">Time Magazine&rsquo;s 100 All-Time Best Novels list</a>.</p>\n<blockquote>\n<p><em><strong>For more details regarding the Watchmen comics, please refer to the <a href=\"https://en.wikipedia.org/wiki/Watchmen\">Wikipedia entry</a>.</strong></em></p>\n</blockquote>\n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\">\n  <iframe src=\"https://www.youtube.com/embed/nSdg36526qU\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"></iframe>\n</div>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Watchmen_(film)\">Zack Snyder&rsquo;s 2009 adaptation</a> was something of a critical success, but in no way a commercial one. On a $150 million dollar budget it only pulled in $187 million at the box office, or in other words a commercial flop. A Director&rsquo;s Cut would be released later in 2009, but that would only increase the film&rsquo;s appreciation amongst critics and would not contribute to the studio’s bottom line in any significant way. A decade later, HBO would release <a href=\"https://en.wikipedia.org/wiki/Watchmen_(TV_series)\">Damon Lindelof&rsquo;s <em>Watchmen</em> TV series</a> which would, like the comics, receive wide critical praise and commercial success and currently has a 96% Fresh rating on Rotten Tomatoes. However the show would differ significantly from the comics taking place thirty four years after the events in the comic books and focusing on racist violence in modern-day Tulsa, Oklahoma, the location of the tragic <a href=\"https://en.wikipedia.org/wiki/Tulsa_race_massacre\">Tulsa Race Massacre</a> in 1921.</p>\n<h2 id=\"dcs-struggle-with-feature-films\">DC’s struggle with feature films</h2>\n<p>DC is not known for making good live action adaptations of their comic book characters, aside from the Batman movies. I won&rsquo;t go into details, but I&rsquo;ll list a few: <em>Steel</em>, <em>Catwoman</em>, <em>Constantine</em>, <em>Superman Returns</em>, <em>Jonah Hex</em>, <em>Green Lantern</em>, <em>Man of Steel</em>, <em>Suicide Squad</em>, <em>Justice League</em>, <em>Shazam!</em>, <em>Black Adam</em>, <em>The Flash</em>, and <em>Blue Beetle</em> are most of their releases in the DC Extended Universe (DCEU), and none of them performed well when compared to Marvel’s blockbuster run. There is, however, one medium in which DC has excelled and Marvel has not; animation. Their animated films, generally referred to as the DC Animated Universe, or DCAU, are produced by Warner Bros. Animation studio.</p>\n<blockquote>\n<p><em><strong>For a complete list of all DCAU animated films released, <a href=\"https://en.wikipedia.org/wiki/List_of_films_based_on_DC_Comics_publications#Theatrically_released_films\">check the Wikipedia entry</a>.</strong></em></p>\n</blockquote>\n<p>From 1993&rsquo;s <em>Batman: Mask of the Phantasm</em> to the just released <em>Watchmen Chapter I</em>, DC has floated a literal armada of top-notch animated features. Sure, there have been duds like the unfortunate adaptation of the already unpopular comicbook, <em>Batman: The Killing Joke</em>, the 2nd and 3rd installments of the three part <em>Justice League: Crisis on Infinite Earths</em> film trilogy, and <em>Superman/Batman: Apocalypse</em> but there have been a lot more highly rated outings like <em>Batman: Under the Red Hood</em>, <em>Justice League: Doom</em>, the sublime <em>Batman: The Dark Knight Returns, Parts 1 &amp; 2</em>, and <em>Justice League: The Flashpoint Paradox</em>. There are many, many more out of the near 60 films so don&rsquo;t feel bad if I&rsquo;m leaving off one of your favorites. I’ve already listed a lot of films, so let&rsquo;s just move on to <em>Watchmen Chapter I</em>.</p>\n<blockquote>\n<p><strong>Editor’s Note</strong>: While DC has had an enormously successful run of animated features, the medium of animation in America has been relegated to the juvenile markets. There are pockets of successful adult animation, like <em>Family Guy</em> and other animated sit-coms and sci-fi like <em>Scavengers Reign</em>, but on the whole, animation isn’t taken seriously in the US.</p>\n</blockquote>\n<h2 id=\"the-breakdown\">The breakdown</h2>\n<p>Now, normally for a review of an animated film, television show, or short I would not go through the history that lead up to that property&rsquo;s release, but <em>Watchmen</em> is different. Since it hit comic book shop shelves in 1986 and hasn’t been developed into a continuing franchise of any significance. I suspect a lot of our younger folk born since 2000 may not be as familiar with the comics as with older readers and an overview is helpful to understand the significance of <em>Watchmen</em> in relation to our history. So, let&rsquo;s take a quick look at the spoiler-free Wikipedia synopsis:</p>\n<blockquote>\n<p><em><strong>Watchmen is set in an alternate reality that closely mirrors the contemporary world of the 1980s. The primary difference is the presence of superheroes. The point of divergence occurs in the year 1938. Their existence in this version of the United States is shown to have dramatically affected and altered the outcomes of real-world events such as the Vietnam War and the presidency of Richard Nixon. In keeping with the realism of the series, although the costumed crimefighters of Watchmen are commonly called &ldquo;superheroes&rdquo;, only one, named Doctor Manhattan, possesses any superhuman abilities. The war in Vietnam ends with an American victory in 1971 and Nixon is still president as of October 1985 upon the repeal of term limits and the Watergate scandal not coming to pass. The Soviet invasion of Afghanistan occurs approximately six years later than in real life.</strong></em></p>\n<p><em><strong>When the story begins, the existence of Doctor Manhattan has given the U.S. a strategic advantage over the Soviet Union, which has dramatically increased Cold War tensions. Eventually, by 1977, superheroes grow unpopular among the police and the public, leading them to be outlawed with the passage of the Keene Act. While many of the heroes retired, Doctor Manhattan and another superhero, known as The Comedian, operate as government-sanctioned agents. Another named Rorschach continues to operate outside the law.</strong></em> [<a href=\"https://en.wikipedia.org/wiki/Watchmen\">SOURCE</a>]</p>\n</blockquote>\n<h2 id=\"the-fundamentals\">The fundamentals</h2>\n<p>The film lines up quite neatly with the comics. <em>Chapter I</em> covers the first five books of the twelve book series and the opening scene is almost a shot-for-shot, word-for-word adaptation of the opening pages. In fact, without having had the trade paperback in front of me while watching I could still tell that much of Alan Moore&rsquo;s gritty dialog and story beats are translated almost directly from the comics to the screen with some streamlining by screenwriter J. Michael Straczynski (<em>Babylon 5</em>, <em>World War Z</em>, <em>The Amazing Spider-Man</em>). <em>Watchmen</em> is very character-driven, so a lot of time is spent with a focus on said characters. However, it is the comic’s more fleshed out dialog in which we get a larger sense of the world of Watchmen that appears to have been trimmed. A simple truth illustrating the differences between the comic and animation mediums is that what we do get in terms of texture and detail is often lost in the flow of the motion picture as we are unable to linger on panels and soak in the additional context that the comics allow.</p>\n<blockquote>\n<p>Documenting all the little changes would take me a lot more time than I am willing to invest. Suffice it to say that the changes do not, as of yet, necessarily detract from the story and help to frame the necessary pacing for the motion-based medium versus the static page while maintaining the overall story arc of the first five issues.</p>\n</blockquote>\n<p>Character design is, due mostly to the 3D CGI, smoother and slightly less textured than the meticulous art of Dave Gibbons (illustration and lettering) and John Higgins (colorist). The positives, however, are that there are no speech bubbles to obfuscate the visuals, the view is wider than in the comic panels, and we can see the body language of characters in motion. One early illustration of the differences is when Dan Dreiberg (Nite Owl II, voice acted by Matthew Rhys) comes home to find Rorschach (Walter Kovacs, voice acted by Titus Welliver) has broken into his front door and is eating cold beans straight from cans in his kitchen. Rorschach&rsquo;s iconic pattern shifting mask is pulled up above his nose revealing the lower half of his face. In the comics, he clearly hasn&rsquo;t shaved in days and has baked bean sauce on his chin where in the film he&rsquo;s clean-shaven, as shown in the comparison below. This is a nitpick, but it&rsquo;s indicative of some of the visual sanitization of the adaptation, likely for budget reasons and/or time constraints. For now, however, that remains speculation.</p>\n<p><img src=\"https://tknblogs.micro.blog/uploads/2024/watchmen-scene-comparison-2024.jpg\" alt=\"LEFT: My 2005 copy of Watchmen, RIGHT: The same scene in the 2024 film.\"></p>\n<p>The comics are laid out by Gibbons in a perfect grid of three by three rectangular panels, only deviating to group into larger panels or , less often, divide them even further into smaller ones, but always maintaining the pureness of 90º angles. I find that this helps define the pacing of the comics, like driving with a steady beat to the ultimate climax of the tale. For the film, overall shot composition, set design, and world building are moderately strong, but is somewhat lacking in the ticking urgency in comparison to the source material. The <a href=\"https://en.wikipedia.org/wiki/Doomsday_Clock\">Doomsday Clock</a> plays a major role in the comics. The panel layout helps to subtly sell the slowly encroaching time, and I feel that is lost in this first chapter, though I can honestly say I don’t know how they’d fix that. The strategically placed shots of period newspapers, however, help to sell the stakes. If you can are able to see them in time.</p>\n<p>There are many things to like about the animation. Color, lighting, and atmospherics are strong. The colors are vibrant and clean while still delivering that dark, foreboding, dismal feeling of experiencing a time on the edge. While the animation technique used is cel-shading it feels very mature, like many strides have been made in technique since 2004’s <em>Appleseed</em>, so it helps to deliver the appearance of the comics coming out of the pages. The one character that really jumped out at me, however, is Dr. Manhattan, and I think that this is mostly due to the fact that his radiation glow eliminates the need for cel-shading.</p>\n<p>Character movement does suffer a bit from 3D figure rigging, but it’s clear they attempted to put a lot of care into trying to make characters look organic and their body language look natural. The end result, however, is that despite that effort, it’s not always successful. As has become common with Western 3D animation the characters are animated on the “twos”, which means they are moved every other frame, a technique from traditional animation due to the extreme cost of animation on the “ones”, or every frame. Unfortunately, there are a number of scenes where movement, such as walking, appears stiff. I am glad, however, that they didn’t go with motion capture.</p>\n<h2 id=\"the-ups\">The Ups</h2>\n<ul>\n<li>One of my favorite parts of <em>Watchmen Chapter I</em> is the flawless handling of the dismally depressing <em>Tales of the Black Freighter</em> that appears as a comic inside both the comic books and the film.</li>\n<li>I also very much like the application of textures throughout which work very well with the lighting and color work.</li>\n<li>The application of depth of field is also excellent which makes me suspect that a cinematographer was involved in production.</li>\n<li>There are also some truly beautiful shots in the film.</li>\n</ul>\n<h2 id=\"the-downs\">The Downs</h2>\n<ul>\n<li>I’m not sure I’d call it an animation error, per se, but during Dr. Manhattan’s Mars monologue where he reflects on the accident that changed him, there is a scene where two characters meet and walk away and one of their shoes appears to pass through a rock. It just seems to me that they should have put the rock somewhere else, but it really stood out to me.</li>\n<li>The 84 minute run-time does not work in the film’s favor, mostly because there is only one more part to be released. Unless Chapter II is significantly longer, they won’t be able to fully adapt all twelve issues of the comics.</li>\n<li>Some of the ugly language from the comics is trimmed from the film. While I don’t like the words used, they aren’t applied gratuitously and have a sharp, cutting point that should have been maintained to illustrate the cultural and sociological undercurrents of division and fear that pervaded the US in the 80’s when the Cold War was intense and AIDS put people on edge.</li>\n</ul>\n<h2 id=\"conclusions\">Conclusions</h2>\n<p>Out of all of DC’s Warner Bros. Animation’s works <em>Watchmen Chapter I</em> sits near the top as one of the best, and not because it’s their first “R” rated film. It is clear that the production team took the adaptation seriously, though were likely saddled with some constraints as illustrated by the short run-time, that there will only be one more part to complete the adaptation, and that quite a lot of contextual dialog was removed in translation.</p>\n<p>What I would really like to see from DC, however, is a real commitment to their animation works teams of writers and animators. I would see that as an increase in budgets for their animated features and to use their writers for their live-action films to increase the script quality well over their current efforts that have plodded onto the big screen.</p>\n<h2 id=\"tkns-nothing-score\">TKN&rsquo;s Nothing Score™</h2>\n<p><img src=\"https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png\" alt=\"1 of 5\"><img src=\"https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png\" alt=\"2 of 5\"><img src=\"https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png\" alt=\"3 of 5\"><img src=\"https://tylerknowsnothing.com/uploads/2024/tkn-rating-half.png\" alt=\"4 of 5\"><img src=\"https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsdown.png\" alt=\"5 of 5\"></p>\n<p>This is my first go at a rating system, so bear with me. I’m a nerd. I give <em>Watchmen Chapter 1</em> three and a half Macs, mostly for story and accuracy and detract points for not going all the way with the animation. Being such an important work from the 1980’s, I believe it deserved a lot more attention and care.</p>",
				"content_text": "![Series art for Chapter I featuring (Left to Right) The Comedian, Dr. Manhattan, Ozymandius, Rorschach, Silk Spectre II, and Nite Owl II.](https://tknblogs.micro.blog/uploads/2024/watchmen-chapter-1-v1-fmjpg-ux10002172404626.jpg)\n\nWhat can I say about *Watchmen* that hasn't already been said... is what I would say if DC hadn't just released the first part of an animated two part adaptation of what is considered one of the finest comic books of all time. But let's talk about the comic book first.\n\nReleased as a 12-issue limited series in 1986 and rendered into a trade paperback combining all twelve issues in 1987, the creation of writer Alan Moore, artist Dave Gibbons, and colored by John Higgins, *Watchmen* was a critical and commercial success and has remained so since its release. It would win a [Hugo Award in 1988](https://www.thehugoawards.org/hugo-history/1988-hugo-awards/) and be added to [Time Magazine's 100 All-Time Best Novels list](https://entertainment.time.com/2005/10/16/all-time-100-novels/slide/all/).\n\n<!--more-->\n\n> ***For more details regarding the Watchmen comics, please refer to the [Wikipedia entry](https://en.wikipedia.org/wiki/Watchmen).***\n\n{{< youtube \"nSdg36526qU\" >}}\n\n[Zack Snyder's 2009 adaptation](https://en.wikipedia.org/wiki/Watchmen_(film)) was something of a critical success, but in no way a commercial one. On a \\$150 million dollar budget it only pulled in \\$187 million at the box office, or in other words a commercial flop. A Director's Cut would be released later in 2009, but that would only increase the film's appreciation amongst critics and would not contribute to the studio’s bottom line in any significant way. A decade later, HBO would release [Damon Lindelof's *Watchmen* TV series](https://en.wikipedia.org/wiki/Watchmen_(TV_series)) which would, like the comics, receive wide critical praise and commercial success and currently has a 96% Fresh rating on Rotten Tomatoes. However the show would differ significantly from the comics taking place thirty four years after the events in the comic books and focusing on racist violence in modern-day Tulsa, Oklahoma, the location of the tragic [Tulsa Race Massacre](https://en.wikipedia.org/wiki/Tulsa_race_massacre) in 1921.\n\n## DC’s struggle with feature films\nDC is not known for making good live action adaptations of their comic book characters, aside from the Batman movies. I won't go into details, but I'll list a few: *Steel*, *Catwoman*, *Constantine*, *Superman Returns*, *Jonah Hex*, *Green Lantern*, *Man of Steel*, *Suicide Squad*, *Justice League*, *Shazam!*, *Black Adam*, *The Flash*, and *Blue Beetle* are most of their releases in the DC Extended Universe (DCEU), and none of them performed well when compared to Marvel’s blockbuster run. There is, however, one medium in which DC has excelled and Marvel has not; animation. Their animated films, generally referred to as the DC Animated Universe, or DCAU, are produced by Warner Bros. Animation studio.\n\n> ***For a complete list of all DCAU animated films released, [check the Wikipedia entry](https://en.wikipedia.org/wiki/List_of_films_based_on_DC_Comics_publications#Theatrically_released_films).***\n\nFrom 1993's *Batman: Mask of the Phantasm* to the just released *Watchmen Chapter I*, DC has floated a literal armada of top-notch animated features. Sure, there have been duds like the unfortunate adaptation of the already unpopular comicbook, *Batman: The Killing Joke*, the 2nd and 3rd installments of the three part *Justice League: Crisis on Infinite Earths* film trilogy, and *Superman/Batman: Apocalypse* but there have been a lot more highly rated outings like *Batman: Under the Red Hood*, *Justice League: Doom*, the sublime *Batman: The Dark Knight Returns, Parts 1 & 2*, and *Justice League: The Flashpoint Paradox*. There are many, many more out of the near 60 films so don't feel bad if I'm leaving off one of your favorites. I’ve already listed a lot of films, so let's just move on to *Watchmen Chapter I*.\n\n> **Editor’s Note**: While DC has had an enormously successful run of animated features, the medium of animation in America has been relegated to the juvenile markets. There are pockets of successful adult animation, like *Family Guy* and other animated sit-coms and sci-fi like *Scavengers Reign*, but on the whole, animation isn’t taken seriously in the US. \n\n## The breakdown\nNow, normally for a review of an animated film, television show, or short I would not go through the history that lead up to that property's release, but *Watchmen* is different. Since it hit comic book shop shelves in 1986 and hasn’t been developed into a continuing franchise of any significance. I suspect a lot of our younger folk born since 2000 may not be as familiar with the comics as with older readers and an overview is helpful to understand the significance of *Watchmen* in relation to our history. So, let's take a quick look at the spoiler-free Wikipedia synopsis:\n\n> ***Watchmen is set in an alternate reality that closely mirrors the contemporary world of the 1980s. The primary difference is the presence of superheroes. The point of divergence occurs in the year 1938. Their existence in this version of the United States is shown to have dramatically affected and altered the outcomes of real-world events such as the Vietnam War and the presidency of Richard Nixon. In keeping with the realism of the series, although the costumed crimefighters of Watchmen are commonly called \"superheroes\", only one, named Doctor Manhattan, possesses any superhuman abilities. The war in Vietnam ends with an American victory in 1971 and Nixon is still president as of October 1985 upon the repeal of term limits and the Watergate scandal not coming to pass. The Soviet invasion of Afghanistan occurs approximately six years later than in real life.***\n>\n> ***When the story begins, the existence of Doctor Manhattan has given the U.S. a strategic advantage over the Soviet Union, which has dramatically increased Cold War tensions. Eventually, by 1977, superheroes grow unpopular among the police and the public, leading them to be outlawed with the passage of the Keene Act. While many of the heroes retired, Doctor Manhattan and another superhero, known as The Comedian, operate as government-sanctioned agents. Another named Rorschach continues to operate outside the law.*** [[SOURCE](https://en.wikipedia.org/wiki/Watchmen)]\n\n## The fundamentals\nThe film lines up quite neatly with the comics. *Chapter I* covers the first five books of the twelve book series and the opening scene is almost a shot-for-shot, word-for-word adaptation of the opening pages. In fact, without having had the trade paperback in front of me while watching I could still tell that much of Alan Moore's gritty dialog and story beats are translated almost directly from the comics to the screen with some streamlining by screenwriter J. Michael Straczynski (*Babylon 5*, *World War Z*, *The Amazing Spider-Man*). *Watchmen* is very character-driven, so a lot of time is spent with a focus on said characters. However, it is the comic’s more fleshed out dialog in which we get a larger sense of the world of Watchmen that appears to have been trimmed. A simple truth illustrating the differences between the comic and animation mediums is that what we do get in terms of texture and detail is often lost in the flow of the motion picture as we are unable to linger on panels and soak in the additional context that the comics allow.\n\n> Documenting all the little changes would take me a lot more time than I am willing to invest. Suffice it to say that the changes do not, as of yet, necessarily detract from the story and help to frame the necessary pacing for the motion-based medium versus the static page while maintaining the overall story arc of the first five issues.\n\nCharacter design is, due mostly to the 3D CGI, smoother and slightly less textured than the meticulous art of Dave Gibbons (illustration and lettering) and John Higgins (colorist). The positives, however, are that there are no speech bubbles to obfuscate the visuals, the view is wider than in the comic panels, and we can see the body language of characters in motion. One early illustration of the differences is when Dan Dreiberg (Nite Owl II, voice acted by Matthew Rhys) comes home to find Rorschach (Walter Kovacs, voice acted by Titus Welliver) has broken into his front door and is eating cold beans straight from cans in his kitchen. Rorschach's iconic pattern shifting mask is pulled up above his nose revealing the lower half of his face. In the comics, he clearly hasn't shaved in days and has baked bean sauce on his chin where in the film he's clean-shaven, as shown in the comparison below. This is a nitpick, but it's indicative of some of the visual sanitization of the adaptation, likely for budget reasons and/or time constraints. For now, however, that remains speculation.\n\n![LEFT: My 2005 copy of Watchmen, RIGHT: The same scene in the 2024 film.](https://tknblogs.micro.blog/uploads/2024/watchmen-scene-comparison-2024.jpg)\n\nThe comics are laid out by Gibbons in a perfect grid of three by three rectangular panels, only deviating to group into larger panels or , less often, divide them even further into smaller ones, but always maintaining the pureness of 90º angles. I find that this helps define the pacing of the comics, like driving with a steady beat to the ultimate climax of the tale. For the film, overall shot composition, set design, and world building are moderately strong, but is somewhat lacking in the ticking urgency in comparison to the source material. The [Doomsday Clock](https://en.wikipedia.org/wiki/Doomsday_Clock) plays a major role in the comics. The panel layout helps to subtly sell the slowly encroaching time, and I feel that is lost in this first chapter, though I can honestly say I don’t know how they’d fix that. The strategically placed shots of period newspapers, however, help to sell the stakes. If you can are able to see them in time.\n\nThere are many things to like about the animation. Color, lighting, and atmospherics are strong. The colors are vibrant and clean while still delivering that dark, foreboding, dismal feeling of experiencing a time on the edge. While the animation technique used is cel-shading it feels very mature, like many strides have been made in technique since 2004’s *Appleseed*, so it helps to deliver the appearance of the comics coming out of the pages. The one character that really jumped out at me, however, is Dr. Manhattan, and I think that this is mostly due to the fact that his radiation glow eliminates the need for cel-shading. \n\nCharacter movement does suffer a bit from 3D figure rigging, but it’s clear they attempted to put a lot of care into trying to make characters look organic and their body language look natural. The end result, however, is that despite that effort, it’s not always successful. As has become common with Western 3D animation the characters are animated on the “twos”, which means they are moved every other frame, a technique from traditional animation due to the extreme cost of animation on the “ones”, or every frame. Unfortunately, there are a number of scenes where movement, such as walking, appears stiff. I am glad, however, that they didn’t go with motion capture.\n\n## The Ups\n* One of my favorite parts of *Watchmen Chapter I* is the flawless handling of the dismally depressing *Tales of the Black Freighter* that appears as a comic inside both the comic books and the film.\n* I also very much like the application of textures throughout which work very well with the lighting and color work.\n* The application of depth of field is also excellent which makes me suspect that a cinematographer was involved in production.\n* There are also some truly beautiful shots in the film.\n\n## The Downs\n* I’m not sure I’d call it an animation error, per se, but during Dr. Manhattan’s Mars monologue where he reflects on the accident that changed him, there is a scene where two characters meet and walk away and one of their shoes appears to pass through a rock. It just seems to me that they should have put the rock somewhere else, but it really stood out to me.\n* The 84 minute run-time does not work in the film’s favor, mostly because there is only one more part to be released. Unless Chapter II is significantly longer, they won’t be able to fully adapt all twelve issues of the comics.\n* Some of the ugly language from the comics is trimmed from the film. While I don’t like the words used, they aren’t applied gratuitously and have a sharp, cutting point that should have been maintained to illustrate the cultural and sociological undercurrents of division and fear that pervaded the US in the 80’s when the Cold War was intense and AIDS put people on edge. \n\n## Conclusions\nOut of all of DC’s Warner Bros. Animation’s works *Watchmen Chapter I* sits near the top as one of the best, and not because it’s their first “R” rated film. It is clear that the production team took the adaptation seriously, though were likely saddled with some constraints as illustrated by the short run-time, that there will only be one more part to complete the adaptation, and that quite a lot of contextual dialog was removed in translation.\n\nWhat I would really like to see from DC, however, is a real commitment to their animation works teams of writers and animators. I would see that as an increase in budgets for their animated features and to use their writers for their live-action films to increase the script quality well over their current efforts that have plodded onto the big screen. \n\n## TKN's Nothing Score™\n![1 of 5](https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png)![2 of 5](https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png)![3 of 5\n](https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsup.png)![4 of 5](https://tylerknowsnothing.com/uploads/2024/tkn-rating-half.png)![5 of 5](https://tylerknowsnothing.com/uploads/2024/tkn-rating-thumbsdown.png)\n\nThis is my first go at a rating system, so bear with me. I’m a nerd. I give *Watchmen Chapter 1* three and a half Macs, mostly for story and accuracy and detract points for not going all the way with the animation. Being such an important work from the 1980’s, I believe it deserved a lot more attention and care. \n",
				"date_published": "2024-09-01T18:48:41-07:00",
				"url": "https://tylerknowsnothing.com/2024/09/01/watchmen-chapter-i.html",
				"tags": ["animation","review"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/28/we-spend-a.html",
				"title": "Orange County California Supervisor allegedly funneled millions to daughter's non-profit",
				"content_html": "<p><img src=\"https://tylerknowsnothing.com/uploads/2024/image-8-28-24-at-10.13am.png\" alt=\"Orange County California Supervisor Andrew Do, accused of fraudulently directing millions of COVID-19 relief fund dollars to a non-profit that employs his daughter and subsequently used for personal expenses. \"></p>\n<p>We spend a lot of time focusing on the National elections. There&rsquo;s nothing wrong with this, but this singular gaze has, for years now, been shifting our attention from local issues to the National stage, and we do so to our civic peril. Over and over again we see so-called politicians leveraging public office for personal gain, regardless of party affiliation. Stay awake. Keep your head on a swivel. #uspol #localpolitics #california #corruption</p>\n<p>&ldquo;Orange County Supervisors Katrina Foley and Vicente Sarmiento are calling for Supervisor Andrew Do to resign Wednesday as authorities investigate allegations of fraudulent spending of COVID-19 relief funds by a nonprofit that employed Do’s daughter.&rdquo;</p>\n<p>&ldquo;Earlier this month, the county sued the Viet America Society and its President Peter Pham, alleging misappropriation of millions of dollars of pandemic relief earmarked for delivery of meals to needy residents. The Hand to Hand Relief organization, which subcontracted with Viet America Society, was also sued.&rdquo;</p>\n",
				"content_text": "![Orange County California Supervisor Andrew Do, accused of fraudulently directing millions of COVID-19 relief fund dollars to a non-profit that employs his daughter and subsequently used for personal expenses. ](https://tylerknowsnothing.com/uploads/2024/image-8-28-24-at-10.13am.png)\n\nWe spend a lot of time focusing on the National elections. There's nothing wrong with this, but this singular gaze has, for years now, been shifting our attention from local issues to the National stage, and we do so to our civic peril. Over and over again we see so-called politicians leveraging public office for personal gain, regardless of party affiliation. Stay awake. Keep your head on a swivel. #uspol #localpolitics #california #corruption\n\n\"Orange County Supervisors Katrina Foley and Vicente Sarmiento are calling for Supervisor Andrew Do to resign Wednesday as authorities investigate allegations of fraudulent spending of COVID-19 relief funds by a nonprofit that employed Do’s daughter.\"\n\n\"Earlier this month, the county sued the Viet America Society and its President Peter Pham, alleging misappropriation of millions of dollars of pandemic relief earmarked for delivery of meals to needy residents. The Hand to Hand Relief organization, which subcontracted with Viet America Society, was also sued.\"\n",
				"date_published": "2024-08-28T10:36:26-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/28/we-spend-a.html",
				"tags": ["politics"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/22/seven-banks-loaned.html",
				"title": "Elon Musk's purchase of Twitter deemed among worst deals of all time",
				"content_html": "<p><img src=\"https://tylerknowsnothing.com/uploads/2024/image-1.png\" alt=\"https://tylerknowsnothing.com/uploads/2024/image-1.png\">\n“Seven banks loaned Elon Musk money totaling $13 billion in 2022 to help him buy Twitter, now known by the obnoxiously generic name X … the [Wall Street] Journal explains that this wasn’t just one of the worst deals since 2008, it’s one of the worst deals of all time.”</p>\n<p>Over the years I have offered many examples of why he’s an idiot. This one takes the cake. #elonmusk #tesla #twitter #xitter #finance <a href=\"https://gizmodo.com/bankers-have-lost-so-much-money-thanks-to-elons-terrible-twitter-deal-2000489136\">gizmodo.com/bankers-h&hellip;</a></p>\n",
				"content_text": "![https://tylerknowsnothing.com/uploads/2024/image-1.png](https://tylerknowsnothing.com/uploads/2024/image-1.png)\n“Seven banks loaned Elon Musk money totaling $13 billion in 2022 to help him buy Twitter, now known by the obnoxiously generic name X … the [Wall Street] Journal explains that this wasn’t just one of the worst deals since 2008, it’s one of the worst deals of all time.”\n\nOver the years I have offered many examples of why he’s an idiot. This one takes the cake. #elonmusk #tesla #twitter #xitter #finance [gizmodo.com/bankers-h...](https://gizmodo.com/bankers-have-lost-so-much-money-thanks-to-elons-terrible-twitter-deal-2000489136)\n",
				"date_published": "2024-08-22T15:21:24-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/22/seven-banks-loaned.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/21/ancient-roman-sarcophagus.html",
				"title": "Ancient Roman sarcophagus discovered being used as a bar in Black Sea resort",
				"content_html": "<!-- raw HTML omitted -->\n<p>Apparently it&rsquo;s illegal to own historical artifacts in Bulgaria. Not a bad idea, to be honest. Such artifacts are snapshots of the rich history of humanity on our lone planet thriving with life in the solar system. It sucks that certain peeps are allowed to develop their own private collections. While I believe that in this case it was likely inadvertent, there are many more who selfishly or for investment purposes collect these items. Additionally, there is now more talk about presevation of cultural heritage going on now in Bulgaria. #history [<a href=\"https://www.euronews.com/my-europe/2024/08/12/beach-bar-sarcophagus-turns-out-to-be-genuine-roman-artefact\">SOURCE</a>]</p>\n",
				"content_text": "<img src=\"uploads/2024/image.png\" width=\"600\" height=\"337\" alt=\"\">\r\n\r\nApparently it's illegal to own historical artifacts in Bulgaria. Not a bad idea, to be honest. Such artifacts are snapshots of the rich history of humanity on our lone planet thriving with life in the solar system. It sucks that certain peeps are allowed to develop their own private collections. While I believe that in this case it was likely inadvertent, there are many more who selfishly or for investment purposes collect these items. Additionally, there is now more talk about presevation of cultural heritage going on now in Bulgaria. #history [[SOURCE](https://www.euronews.com/my-europe/2024/08/12/beach-bar-sarcophagus-turns-out-to-be-genuine-roman-artefact)]\n",
				"date_published": "2024-08-21T15:15:21-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/21/ancient-roman-sarcophagus.html",
				"tags": ["Photo"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/20/americas-legal-system.html",
				"title": "America's legal system at work... for Billionaires",
				"content_html": "<p>You know what&rsquo;s great about #sarcasm? It&rsquo;s hilarious and it allows us to laugh at terrible things being done by terrible people for terribly stupid reasons. The Legal Eagle seems to agree&hellip; or concur or however lawyers prefer to say it. In that spirit, isn&rsquo;t it also great that America lets geniuses like #ElonMusk take steps to force silly advertisers unwilling to be associated with Hitler and Nazis to pay #Xitter to advertise again? This is, after all, the AmeriKKKan way!</p>\n\n<div style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\">\n  <iframe src=\"https://www.youtube.com/embed/_IUHMuBH788\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"></iframe>\n</div>\n\n",
				"content_text": "You know what's great about #sarcasm? It's hilarious and it allows us to laugh at terrible things being done by terrible people for terribly stupid reasons. The Legal Eagle seems to agree... or concur or however lawyers prefer to say it. In that spirit, isn't it also great that America lets geniuses like #ElonMusk take steps to force silly advertisers unwilling to be associated with Hitler and Nazis to pay #Xitter to advertise again? This is, after all, the AmeriKKKan way! \n\n{{< youtube \"_IUHMuBH788\" >}}\n",
				"date_published": "2024-08-20T07:53:16-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/20/americas-legal-system.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/09/if-you-question.html",
				"title": "Russia's insane revisionist pulp fiction industry",
				"content_html": "<!-- raw HTML omitted -->\n<p>If you question why the general population of #Russia supports the #war in #Ukraine there&rsquo;s likely one fact you are unaware of. I certainly knew nothing about this, because it is one of the single most insane methods of #propaganda sponsored by any sovereign state I have ever seen. This is bat shit crazy on steroids, crossed with Cthulhu, and cloned into oblivion. If you know of something more ludicrous and insidious, do let me know. #youtube #video #culture #putin #insane <a href=\"https://youtu.be/iCI6es9G0oo\">youtu.be/iCI6es9G0&hellip;</a></p>\n",
				"content_text": "<img src=\"https://tknblogs.micro.blog/uploads/2024/russian-pulp-fiction-2024.jpeg\" width=\"600\" height=\"328\" alt=\"\">\n\nIf you question why the general population of #Russia supports the #war in #Ukraine there's likely one fact you are unaware of. I certainly knew nothing about this, because it is one of the single most insane methods of #propaganda sponsored by any sovereign state I have ever seen. This is bat shit crazy on steroids, crossed with Cthulhu, and cloned into oblivion. If you know of something more ludicrous and insidious, do let me know. #youtube #video #culture #putin #insane [youtu.be/iCI6es9G0...](https://youtu.be/iCI6es9G0oo)\n",
				"date_published": "2024-08-09T12:06:32-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/09/if-you-question.html",
				"tags": ["politics"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/08/mark-my-words.html",
				
				"content_html": "<p>Mark my words, #TFG&rsquo;s numbers will keep dropping and #HarrisWalz will keep going up. Not at the same rate, mind you. Slowly for The Dumpster Fire in Chief and the plateau as his base is just that weird, but steadily for the NKOTB. And The Bestest Florida Man is spiraling, badly. I can&rsquo;t say there won&rsquo;t be violence, but we need to be prepared for anything. #uspol #harriswalz2024 #voteblue <a href=\"https://boingboing.net/2024/08/08/ouch-harris-keeps-surging-ahead-of-trump-up-8-points-in-latest-poll.html\">boingboing.net/2024/08/0&hellip;</a></p>\n",
				"content_text": "Mark my words, #TFG's numbers will keep dropping and #HarrisWalz will keep going up. Not at the same rate, mind you. Slowly for The Dumpster Fire in Chief and the plateau as his base is just that weird, but steadily for the NKOTB. And The Bestest Florida Man is spiraling, badly. I can't say there won't be violence, but we need to be prepared for anything. #uspol #harriswalz2024 #voteblue [boingboing.net/2024/08/0...](https://boingboing.net/2024/08/08/ouch-harris-keeps-surging-ahead-of-trump-up-8-points-in-latest-poll.html)\n",
				"date_published": "2024-08-08T13:43:12-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/08/mark-my-words.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/08/the-amount-of.html",
				
				"content_html": "<p>The amount of free space in the Mini is a rather egregious waste of case materials and I can easily see #Apple being unwilling to continue to waste resources on manufacturing an unnecessarily large part. #tech #rumor <a href=\"https://www.macrumors.com/2024/08/08/mac-mini-to-become-smallest-ever-apple-computer/\">www.macrumors.com/2024/08/0&hellip;</a></p>\n",
				"content_text": "The amount of free space in the Mini is a rather egregious waste of case materials and I can easily see #Apple being unwilling to continue to waste resources on manufacturing an unnecessarily large part. #tech #rumor [www.macrumors.com/2024/08/0...](https://www.macrumors.com/2024/08/08/mac-mini-to-become-smallest-ever-apple-computer/)\n",
				"date_published": "2024-08-08T09:16:15-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/08/the-amount-of.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/07/this-bizarre-trend.html",
				
				"content_html": "<p>This bizarre trend of taking successful #TV and #film properties and creating #stage and #musical versions is annoying. #Japan is on a huge binge of this very thing, putting all manner of #manga and #anime on stage. I guess I&rsquo;d have to see it, or is this the death of creativity? #media <a href=\"https://www.engadget.com/entertainment/streaming/stranger-things-will-make-its-broadway-debut-in-march-2025-140015764.html\">www.engadget.com/entertain&hellip;</a></p>\n",
				"content_text": "This bizarre trend of taking successful #TV and #film properties and creating #stage and #musical versions is annoying. #Japan is on a huge binge of this very thing, putting all manner of #manga and #anime on stage. I guess I'd have to see it, or is this the death of creativity? #media [www.engadget.com/entertain...](https://www.engadget.com/entertainment/streaming/stranger-things-will-make-its-broadway-debut-in-march-2025-140015764.html)\n",
				"date_published": "2024-08-07T21:26:03-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/07/this-bizarre-trend.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/07/i-think-its.html",
				
				"content_html": "<p>I think it&rsquo;s really, really important to understand one thing about #TFG; #Trump projects. He&rsquo;s clearly unstable and he explains to everyone how unstable he is by projecting his faults and fears and issues onto others, in this instance, #Biden, #Harris, and #Walz. If he&rsquo;s not projecting, he just makes up shit about them, like Harris being the &ldquo;Border Czar&rdquo;, a role she has <strong>never</strong> held. I&rsquo;m sure he just like&rsquo;s using a Russian term for her since he&rsquo;s so deep into #Putin&rsquo;s pocket he can&rsquo;t see daylight.</p>\n<p>The only reason you would vote for this guy at this point is if you want to destroy American democracy and see a terrifying number of people harmed, jailed. and/or killed. #harriswalz2024 #uspol <a href=\"https://boingboing.net/2024/08/07/spinning-out-of-control-donald-trump-authors-an-unhinged-fantasy-about-joe-biden.html\">boingboing.net/2024/08/0&hellip;</a></p>\n",
				"content_text": "I think it's really, really important to understand one thing about #TFG; #Trump projects. He's clearly unstable and he explains to everyone how unstable he is by projecting his faults and fears and issues onto others, in this instance, #Biden, #Harris, and #Walz. If he's not projecting, he just makes up shit about them, like Harris being the \"Border Czar\", a role she has **never** held. I'm sure he just like's using a Russian term for her since he's so deep into #Putin's pocket he can't see daylight. \n\nThe only reason you would vote for this guy at this point is if you want to destroy American democracy and see a terrifying number of people harmed, jailed. and/or killed. #harriswalz2024 #uspol [boingboing.net/2024/08/0...](https://boingboing.net/2024/08/07/spinning-out-of-control-donald-trump-authors-an-unhinged-fantasy-about-joe-biden.html)\n",
				"date_published": "2024-08-07T16:16:56-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/07/i-think-its.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/08/07/well-well-well.html",
				
				"content_html": "<p>Well, well, well. Here we are. Another platform, and not for lack of trying to stick one out for a long time. I started with PHPsomething-or-other, migrated to WordPress for years, latched onto PostHaven, then Medium, and now back to PostHaven. Now I&rsquo;m here because PostHaven feels stagnant. Whee.</p>\n",
				"content_text": "Well, well, well. Here we are. Another platform, and not for lack of trying to stick one out for a long time. I started with PHPsomething-or-other, migrated to WordPress for years, latched onto PostHaven, then Medium, and now back to PostHaven. Now I'm here because PostHaven feels stagnant. Whee.\n",
				"date_published": "2024-08-07T15:27:29-07:00",
				"url": "https://tylerknowsnothing.com/2024/08/07/well-well-well.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2024/07/02/a-list-of.html",
				"title": "A list of things that pair well with McDonald's Szechuan Sauce",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<p><img title=\"Image: https://i.imgflip.com/46x3aw.jpg\" src=\"https://i.imgflip.com/46x3aw.jpg\" alt=\"httpsiimgflipcom46x3awjpg\" /></p>\n<p>Whilst having a conversation with a friend he wanted to give me a list of foods that would probably taste good with Szechuan sauce. Considering the list itself, I have a feeling that it's not as tasty as he might recall. These are compiled from our talk on the matter over one of the popular (but not too popular) messaging apps:</p>\n\n<!--more-->\n\n<p>    •    Giraffe  <br />    •    Mitochondrial DNA <br />    •    Rejected chicken nuggets  <br />    •    Some species of bat <br />    •    Wallet chains  <br />    •    Cowboys, either the individuals or the football team  <br />    •    Melancholy <br />    •    Grubs  <br />    •    Piston linkages  <br />    •    Peat moss <br />    •    Waffles you found on the bus  <br />    •    Stephen Hawking <br />    •    Misplaced dentures <br />    •    Reading glasses that are too strong <br />    •    Steak sandwiches sent back by the elderly because they were too chewy <br />    •    Geronimo <br />    •    Wet dog fur<br />    •    Regurgitated baskets<br />    •    Hairless cats <br />    •    Old wine<br />    •    Moldy pepper<br />    •    Tea cup yorkies<br />    •    Defanged rabbits <br />    •    Clusterfucks<br />    •    Office cubicle dividers<br />    •    Ceiling panels  <br />    •    Asbestos <br />    •    Shoe leather, used <br />    •    Stone masons<br />    •    Wood mill trash<br />    •    Glass blowers  <br />    •    Blown glass<br />    •    Topical ointments and balms<br />    •    Beef Wellington thrown from a moving van<br />    •    Sparrows<br />    •    Staples that went through a stapler incorrectly and had to be discarded <br />    •    Ass magnets <br />    •    Ben Carson’s underwear <br />    •    Carson Daly<br />    •    Anything prepared by Kelly Clarkson<br />    •    Photo collage<br />    •    Minty suppositories<br />    •    Asps and vipers<br />    •    Novelty hats<br />    •    Discarded carnival food waste<br />    •    Brazil nuts<br />    •    20 gallon tubs of lube (the kind you're thinking of right now)<br />    •    Spider monkeys<br />    •    Lightly used XS condoms<br />    •    Sinusitis<br />    •    Ferns<br />    •    Charlie Bucket<br />    •    Shaving strops<br />    •    Strap-on food processors<br />    •    Live Love Laugh wall plaques<br />    •    The small guest toilet just inside the main door of the Tardis <br />    •    Sten the Swede<br />    •    Wacko of the Warner Bros <br />    •    Regolith from the dim side of the moon <br />    •    Megatron<br />    •    Knee joints that have been replaced with a surgical implant <br />    •    Bill Gates divorce papers<br />    •    The worn elbow patches from a drunk English teachers coat <br />    •    Warren<br />    •    Cyber crime<br />    •    Dead skin flakes and/or dandruff<br />    •    Dan Cortez<br />    •    Goat nipples</p>\n<p>Please feel free to contribute your own pairings in the comments below.</p>\n",
				"date_published": "2024-07-02T17:54:15-07:00",
				"url": "https://tylerknowsnothing.com/2024/07/02/a-list-of.html",
				"tags": ["satire"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/06/27/im-done-with.html",
				"title": "I'm done with Microsoft Windows",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<p><img title=\"Image: https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/10592845500739047904.png\" src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/10592845500739047904.png\" /></p>\n<p>As of May 31st, 2024 when Microsoft announced Windows Recall, I have a single physical machine, and no virtual machines, with any version of Windows installed and that will not be changing as long as Microsoft remains on the path they're forged for themselves. The one machine which has Windows 10 is a Dell Venue 8 Pro which needs a dongle to install another operating system, and I need to find the dongle. Once I find the dongle, Windows is gone, gone, gone. Why would I go through so much trouble getting rid of Windows?</p>\n\n<!--more-->\n\n<p>In short, mostly Windows 11 and that I'll have to pay to get support for Windows 10 in October of 2025, but also everything Microsoft is doing now that is clearly anti-consumer. Let's dig into the demonstrable reasons:</p>\n<ul>\n<li>Microsoft has added advertising to the interface and start menu. There are also ads in Bing and in your desktop news feed. <a title=\"Link: https://www.theverge.com/2024/4/24/24138949/microsoft-windows-11-start-menu-ads-recommendations-setting-disable\" href=\"https://www.theverge.com/2024/4/24/24138949/microsoft-windows-11-start-menu-ads-recommendations-setting-disable\">Most articles regarding this \"feature\" explain how to disable them</a>. How long will we be able to disable the ads? I paid for a computer. I want to own it, not pay rent on top of a \"deposit.\" And in the latest insult, <a title=\"Link: https://www.techradar.com/computing/windows/microsoft-has-gone-too-far-including-a-game-pass-ad-in-the-settings-app-ushers-in-a-whole-new-age-of-ridiculous-over-advertisinghttps://\" href=\"https://www.techradar.com/computing/windows/microsoft-has-gone-too-far-including-a-game-pass-ad-in-the-settings-app-ushers-in-a-whole-new-age-of-ridiculous-over-advertisinghttps://\" target=\"_blank\" rel=\"noopener\">they've now added advertising for the Game Pass subscription to the Settings</a>.</li>\n</ul>\n<ul>\n<li>Microsoft has been increasing the level of deep integration with their own services and resources. <a title=\"Link: https://www.cnn.com/2024/06/25/tech/microsoft-teams-eu-antitrust/index.html\" href=\"https://www.cnn.com/2024/06/25/tech/microsoft-teams-eu-antitrust/index.html\">The European Union is fining Microsoft $3 billion for bundling Teams and Office with Windows 11</a>.</li>\n</ul>\n<ul>\n<li>Microsoft has been diving head-first into the AI \"revolution\". While AI may be Artificial, it is far from Intelligent. Microsoft doesn't care though, since it's the new \"hotness\" and the shareholders need to be kept happy. <a title=\"Link: https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/\" href=\"https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/\">As such keyboards get a Copilot key, Windows gets Copilot features, and new ARM-based computers like the Surface Pro Copilot+ tablet are designed around AI</a>.</li>\n</ul>\n<ul>\n<li>Recently, <a href=\"https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/\">Microsoft was going to be releasing the AI-powered </a><a href=\"https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/\"><i><strong>Recall</strong></i></a><a href=\"https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/\"> feature which takes screenshots of everything you do everywhere and has been referred to by security experts as \"commercial malware\", but after significant backlash from almost everyone, they've delayed the launch</a>.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.zdnet.com/article/when-windows-10-support-ends-you-have-5-options-but-only-2-are-worth-considering/\">Microsoft is ending support for Windows 10 in October 2025</a>. And if you have a system that has been proven to easily run Windows 11, but isn't officially supported you are shit out of luck. You either pay for ongoing support, live without getting security updates, or stop using it and buy a compatible device. This isn't a great look for one of the wealthiest corporations in the World. It's a greedy look, especially for people who can't afford to drop $1,000+ on a new PC. At the very least, it's tone deaf AF.</li>\n</ul>\n<ul>\n<li><a href=\"https://arstechnica.com/gadgets/2024/06/microsoft-reopens-beta-program-to-test-new-features-for-windows-10/\">Microsoft has reopened Windows 10 beta channels</a> and will start adding some Windows 11 features into the older system, despite them ending support for the platform next year. And by \"new\" features, it likely means AI, ads, and more tracking. And don't forget, Microsoft is still selling your data, and you're paying them for the privilege.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.tomshardware.com/software/operating-systems/windows-11-market-share-declines-as-users-seemingly-shift-back-to-windows-10\">Users are so unhappy with Windows 11 they are reinstalling Windows 10</a>, again despite Microsoft ending support it in 2025, which is likely what prompted Microsoft to start development of Windows 10 again (See above). Hey Microsoft, here's a Pro Tip: If your users feel like their operating system isn't letting them be productive and switch back to a previous version, maybe what you're doing isn't working.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.theverge.com/2021/6/29/22555371/microsoft-windows-11-cpu-support-hardware-requirements-tpm-response\">Microsoft has made Windows 11 hardware requirements incredibly restrictive</a>, meaning you cannot install it on anything but the more recent CPUs and requires TPM, so that limits installation to mostly Intel and AMD systems with integrated TPM, or requires the installation of a TPM 2.0 module into desktop systems like gaming machines. <a href=\"https://www.theverge.com/22644194/microsoft-windows-11-minimum-system-requirements-processors-changes\">And it's not like older machines are incapable of running Windows 11</a>. While better security is always better, and TPM 2.0 definitely provides that like Apple did with Secure Enclave years ago, these choices by Microsoft and Apple still leave a lot of working computers to be relegated to the landfills, since only a small percentage end up going to collectors or are redirected to groups which repair older computers for people who can't afford to buy their own.</li>\n</ul>\n<blockquote>\n<p>There are organizations in various parts of the US that take donations or older computers, refurbish them, and sell for cheap or donate them to families in need. One fantastic resource is</p>\n<p><a href=\"https://digitunity.org/our-programs/aftrr/aftrr-map/\">Digitunity's AFTRR location map</a></p>\n<p>which lists US and Canadian organizations that take computer donations, refurbish them, and provide them to people and families in need. Another resource is the</p>\n<p><a href=\"https://impactful.ninja/best-charities-for-tech-computer-recycling/\">list of organizations at Impactful.Ninja</a></p>\n<p>, which is up-to-date as of 2024. If you have more resources, comment on this post to let me know and I'll add them if they check out :)</p>\n</blockquote>\n<ul>\n<li><a href=\"https://9to5mac.com/2024/06/26/us-mac-market-share-q1-2024/\">Due to the overwhelming success of Apple's shift to their own ARM architecture for all of their systems</a>, the rest of the industry is starting to follow suit, including Microsoft. If ARM takes over the overall marketplace for personal computers, the only operating systems you'll be limited to on older x86 systems that are still viable will be unsupported Windows and Linux, as well as a few other lesser known platforms (i.e., BSD, Haiku, RISC-OS). And if you've invested in Microsoft-compatible software, you can kiss that all goodbye unless you buy into Microsoft's subscription model.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.pcmag.com/how-to/windows-11-tablet-users-get-ready-to-relearn-everything\">Microsoft has consistenly removed more and more tablet functionality since the Windows 8 redesign debacle</a>. While Windows 8 was terrible, it worked fantastic on tablets, including Microsoft's own Surface devices. Many of the tablet gesture functionality remained in Windows 10, and Microsoft still makes Surface Pros, but they are less and less \"tablet\" computers year after year. What's even the point anymore?</li>\n</ul>\n<ul>\n<li><a href=\"https://gizmodo.com/gateway/windows-11-is-making-it-absurdly-difficult-to-change-br-1847510904\">M</a><a href=\"https://gizmodo.com/gateway/windows-11-is-making-it-absurdly-difficult-to-change-br-1847510904\">icrosoft has made it unpleasantly difficult to switch default applications, most egregiously Edge</a>. And there are some things that, no matter what you do, will still open Edge, making the selection of another default web browser a farce, at the very least. This alone makes the computer you've paid for not feel like it belongs to you.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.zdnet.com/article/microsoft-clamps-down-on-windows-11-users-who-want-local-accounts-but-this-trick-still-works/\">You can no longer use a Windows 11 system with a local-only account</a>. Microsoft now forces you to login using a MIcrosoft account. This isn't a thing on any other operating system, even macOS. While I don't think this applies to most users, if there are a few who don't want to have a Microsoft account to use their computer, that should be their choice.</li>\n</ul>\n<ul>\n<li>The Start Menu and Taskbar and far less functional than in Windows 10 and earlier Windows systems since at least Windows XP. <a href=\"https://www.pcworld.com/article/539183/windows-11-review-an-unnecessary-replacement-for-windows-10.html\">Mark Hachman's review of Windows 11 features two major problems with the redesign, and they are the Taskbar and Start Menu</a>. Despite being from 2021, these problems have only gotten worse due to several unpopular changes and the addition of advertising.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.zdnet.com/article/microsoft-may-try-to-block-third-party-customization-apps-in-windows-11-24h2/\">Customization options for Windows 11 are dwindling</a>. Third party support is being leached away. There's no more Action Center, a feature of Windows 10 that became very popular. Bing is featured, and it's not a popular search engine and it now highlights AI summaries. That News sidebar thingy that's full of ads, advertorials, and questionable \"news\". Sorting in the file manager is weird. Context menus throughout the system are weird.<a href=\"https://www.howtogeek.com/switched-to-windows-11-and-miss-windows-10-features/\"> So much is unnecessarily weird, and people aren't happy</a>.</li>\n</ul>\n<ul>\n<li>Finally, there's decreasingly little one cannot do on a Mac or Linux machine with the same or equivalent applications or through web apps. In other words, users no longer need Windows to do anything but the most bespoke of tasks that require Windows. Sites like <a href=\"https://switching.software/\">Switching.Software</a> and <a href=\"https://alternativeto.net/\">AlternativeTo.net</a> help you easily find replacement apps instead of being chained to Windows.</li>\n</ul>\n<p>I am, first and foremost, a Mac guy. I've been using Apple computers since the early 80's, and my first full-time Mac was an Apple PowerBook 145b in the early-90's. When I started writing professionally in the late-90's I'd added a PowerMac 7300/200 and a Newton MessagePad 130 to my stable. Despite my technical editing and revision contracts were predominantly for Windows books, I used my PowerMac to run Windows 95 and 98 in Connectix's Virtual PC to complete my work, and never once disappointed an editor (except when I missed deadlines, of course). It was a potent combination for the time.</p>\n<p>In the early 2000's I started fiddling with Linux, taught myself how to build my own system based on Caldera's OpenLinux using internet resources and, using a Packard-Bell desktop running Citrix MetaFrame, served Windows apps to my Linux desktop over our home network. I ended up cruising on Macs and Linux machines almost exclusively through to 2011 when my MacBook Pro was stolen from a Starbucks.</p>\n<p>It was quite the blow. And I had begun to be disenchanted with Apple at that time, so I dove into the PC ecosystem and Windows 7. I then struggled through Windows 8 until Windows 8.1 and 3rd party utilities improved it, then migrated to Windows 10 when the betas became stable. But in recent years, Microsoft has been backsliding from many of the advances they'd made during the Windows 10 era.</p>\n<p>Then Windows 11 was introduced when Microsoft had strongly suggested that they were doing to drop the number scheme and just keep updating Windows continuously. That alone made people upset, but in the beginning it was much like Windows 10 with a new desktop experience that was... novel.</p>\n<p>It didn't take long for that novelty to start wearing thin, however. Microsoft dropped the ball on a number of exciting projects like the Surface Duo, yet another in a long line of mobile device flops they've attempted following their initial success in the 2000's, and the Hololens, their mixed reality headset that was supposed to usher in a new age of computing, but is now only available for enterprise customers. <a href=\"https://www.versionmuseum.com/history-of/discontinued-microsoft-products\">In fact, Microsoft has bombed on a shocking number of projects over the years</a>.</p>\n<p>Ultimately it is the general air of disrespect and disdain for users that is wafting from Redmond in 2023-2024 that has finally irretrievably soured me on Microsoft. While I dislike absolutes, I find it highly unlikely that Satya Nadella will turn make significant changes to the plan he's been ushering in, at least not without facing down a sizeable consumer backlash that will threaten stock prices and spook investors.</p>\n<p>I guess we'll just have to wait and see if it comes to that.</p>\n",
				"date_published": "2024-06-27T13:10:01-07:00",
				"url": "https://tylerknowsnothing.com/2024/06/27/im-done-with.html",
				"tags": ["editorial","featured"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/05/19/mastering-the-macos.html",
				"title": "Mastering the macOS Menu Bar",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<div class=\"posthaven-post-body\">\n<p>I came across the following article on Apple Insider a few days ago and was initially enthused. I'd recently written a quick guide to a freeware tool for the Mac called <i>Spaced</i> and was hoping to find some more gems to get my menu bar under even more control. It turned out to be little more than an advertisement for Bartender, a paid app. </p>\n<p>So, I've decided to write my own guide instead and this post has no paid anything. It's <i>all</i><i> freeware.</i></p>\n\n<!--more-->\n\n<h1>Using the basic menu bar</h1>\n<p>The macOS menu bar already has some in-built functionality for management of the icons added by the system, and many apps add icons to the menu bar upon installation. Let's run through the basics first, then we'll get into adding freeware to help you add some additional functions. </p>\n<h3>Moving icons</h3>\n<ol><li>\n<strong>CMD+CLICK</strong> on the icon you want to move. The icon will dim and stick to your mouse pointer.</li></ol>\n<ol><li>Drag the icon to the position you want it to stay. Like the Dock, the other icons will make room as you move the icon around, giving you space to drop it.</li></ol>\n<ol><li>Release the mouse button. </li></ol>\n<p>The vast majority of menu bar icons can be organized in this way, but some are reserved by the system. Those are <i>Control Center, Siri, and Date & Time</i>. Those three always remain all the way to the right end of the menu bar.</p>\n<h3>Removing icons</h3>\n<ol><li>\n<strong>CMD+CLICK</strong> on the icon you want to remove. The icon will dim and stick to your mouse pointer. </li></ol>\n<ol><li>Drag it away from the menu bar. </li></ol>\n<ol><li>When the \"Ⓧ\" appears next to the mouse pointer, release the mouse button. If the icon cannot be removed, you'll see \"🚫\" and it will jump back to where it was when you grabbed it when you release the mouse button.</li></ol>\n<p>While the menu bar does behave a bit like the Dock, it also does not. There's no Applications folder from which you can drag icons back to the menu bar. These functions are generally found in the options for various apps which offer menu bar icons or in the macOS Settings app for the various functions (i.e., wifi, Bluetooth, sound, etc.) Most of these, however, are handled by the <strong>Control Center</strong> which I cover in detail in the next section.</p>\n<blockquote><i><b>Editor's Note</b>: It is both difficult to take screenshots of these actions and to find a \"nope\" symbol that is an emoji and isn't red or a very small wingding. Sorry if it looks weird!</i></blockquote>\n<p>Try to keep track of the apps that you remove menu bar icons for so you can turn them back on if you change your mind. You might also want to make sure that menu bar icon isn't actually helpful before you discard it. Optionally, you can remove it from the apps options panel so you've at least seen where the setting is should regret set in. </p>\n<h3>The Control Center</h3>\n<p>Apple knows that the menu bar can get crowded after a while, which I am sure is the reason they added the <strong>Control Center</strong> to macOS. On my desktop, it looks like this:</p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/11392565471928234723.png\"><p>If you want to add a Control Center item to your menu bar, simply click and drag it over. You don't need to hold the CMD key. Adding a Control Center widget to the menu bar does <i>not</i><i> remove it from the Control Center, so if at some point you want to remove it from the menu bar, it will remain avaiable in the Control Center. </i> </p>\n<blockquote>\n<b>NOTE</b><i>: You can also control the Control Center and where widgets appear in  > System Settings... > Control Center. Options are </i>Don't Show in Menu Bar, Show in Menu Bar<i>, and for some, </i>Show When Active<i>. There are also additional modules you can add to either location, such as Fast User Switching or Accessibility Shortcuts.</i>\n</blockquote>\n<p>Unless I've missed something, that's pretty much it. So, let's move on to the next level... enhancements.</p>\n<h1>Enhancing the basic menu bar</h1>\n<p>You <i>can</i><i> buy a few utilities to make your menu bar more functional, but I'm going to focus entirely on freeware solutions. The first utility is one I've already written about. You can find details about that utility in the following post:</i></p>\n<p>In short, you combine the menu bar's in-built organization features with the<i> clonable spacers of </i><i>Spaced</i><i> to effectively replicate Bartender's most visible feature. </i></p>\n<h3>Hiding menu bar items</h3>\n<p>Next we have <a href=\"https://apps.apple.com/us/app/hidden-bar/id1452453066?mt=12\"><strong><i>Hidden Bar</i></strong></a> from Dwarves Foundation. Not only is it rated 4.5, #40 on the top 100 utilities list, and an Editor's Choice, it's entirely free. It's also simple to use, as illustrated in the image below. </p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/15634742094822612837.png\"><p>Using what you learned earlier about how to move icons around the menu bar, any icons you place to the left of the widget will be hidden away, either automatically after a set time or manually. The settings are as follows:</p>\n<ul><li>\n<strong>Start Hidden Bar when I log in</strong> - The standard fare for utilities. This option launched the utility when you boot or reboot your machine so it's always running. </li></ul>\n<ul><li>\n<strong>Show preferences on launch</strong> - This is helpful while you're getting it set up. You can uncheck this when you're ready. </li></ul>\n<blockquote>\n<b>TIP</b>: <i>To access the Preferences when you've disabled this option, right click on the section bar \"|\" when Hidden Bar is expanded. You can also toggle the auto collapse feature and quit the app entirely from this menu.</i>\n</blockquote>\n<ul><li>\n<strong>Use the full menu bar on expanding</strong> - I'd suggest you leave this off. When on, instead of expanding in the background and still showing the active app's menus, it switches to Hidden Bar's menu giving more room for more icons since Hidden Bar only has one menu. I presume this is helpful is you have a ludicrous number of icons on the menu bar, your apps have lots of menus, or you are using a MacBook Pro with a notch, none of which I have, so I can't say. </li></ul>\n<ul><li>\n<strong>Enable always hidden section</strong><strong> - Unless you have icons you rarely need to access or see, you can leave this off. If you can, it's better to just turn off the menu bar option for these apps or utilities. When enabled, however, an additional section is added to the Hidden Bar area, as shown in the image below. Any icons moved to this section appear when you right-click the icon. </strong>\n</li></ul>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/9358964248458029837.png\"><blockquote>\n<b>NOTE</b>: <i>Right clicking the Hidden Bar icon acts as a toggle between showing and hiding the Always Hidden section</i>. </blockquote>\n<ul><li>\n<strong>Automatically hide icon after </strong><strong>- You can choose from 5, 10, 15, and 30 seconds, and one minute. As it states on the tin, Hidden Bar collapses itself when you've left it alone for the selected period of time. </strong>\n</li></ul>\n<ul><li>\n<strong>Global Shortcut</strong><strong> - If you'd like to have keyboard access to the icons you have in Hidden Bar, you can enter your own shortcut but clicking </strong><strong>Set Shortcut</strong><strong> and pressing a key combination, i.e., CTRL+OPT+CMD+H. This works like left-clicking the Hidden Bar icon, but does not have an option for showing Always Hidden icons. Do note, however, that clicking Set Shortcut gives no feedback until you press keys.</strong>\n</li></ul>\n<p>And that's pretty much that. With two free utilities and the in-built menu bar management tools of macOS, you've basically recreated the functionality of Bartender. </p>\n<h1>Changing the appearance of the menu bar</h1>\n<p>As you might have noticed in my screenshot in the Control Center section, my menu bar doesn't look like the standard menu bar that ships with macOS 14 \"Sonoma\", and for good reason; it's not. That's because I use <a href=\"https://apps.apple.com/us/app/lickable-menu-bar/id6444217677?mt=12\">Lickable Menu Bar</a>, a freeware utility available on the App Store. It's a simple utility that doesn't even bother with a menu bar icon. </p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/4123788574752713924.png\"><p>The only thing this utility does is allow you select one of three older versions of the menu bar's appearance, and in my case I have a preference for the menu bar of macOS Mavericks. It's also rather self-explanatory. </p>\n<p>When you first run the app you'll see the settings dialog above. Simply click the theme you like, and the changes are made instantly. Make sure to check the <strong>Launch at Login</strong> option for it to start automatically and uncheck the <strong>Show this window at launch</strong> option when you're happy with your selection. </p>\n<p>If you want to make a change after you've turned off the dialog, just launch the app again and the setting dialog will appear. If you want to stop using it, you can either uninstall it by dragging the app to the Trash or uncheck the <strong>Launch at Login</strong><strong> option and quit the app using the app menu or the \"Quit\" button in the lower right corner of the dialog. Easy peasy. </strong></p>\n<h1>Some honorable mentions...</h1>\n<p>While the following utilities don't modify or enhance the menu bar itself, they do add useful functions to the menu bar. </p>\n<ul><li>\n<strong>WhatsOn - Now Playing</strong><strong> [</strong><a href=\"https://apps.apple.com/us/app/whatson-now-playing/id1136082516?mt=12\"><strong>App Store link</strong></a><strong>] - WhatsOn is a very simple menu bar utility that tells you what's playing in Apple Music. This is quite nice since the desktop notification doesn't last that long and Music may be minimized to the Dock or hiding behind another window. Clicking on it gives you access to controls and album art and details. </strong>\n</li></ul>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/408cc120-bd9a-4c69-a665-b34df0edfeeb/blob/6912591768095425862.png\"><ul><li>\n<strong>ClipTools </strong><strong>[</strong><a href=\"https://macmost.com/cliptools\"><strong>Website link</strong></a><strong>] - </strong>This free utility from MacMost.com makes your Mac's clipboard into a powerhouse and, unlike the other apps in this post, this one is not available in the App Store. It remembers everything you've copied, allows you to save specific clips for quick pasting, and lots of other functions. The only downside to the utility is that it does not store copied images. So, if you copy an image and then copy some text, you will not find that previously copied image in the list of clips. If, however, you use your clipboard a lot, this is a must have.<strong> </strong>\n</li></ul>\n<img src=\"https://macmost.com/wp-content/uploads/ClipTools2.jpg\"><h1>The takeaway</h1>\n<p>The menu bar appears to be a very simple tool in a rich and capable operating system, but it can be much more than that. It's nice to know that there are plenty of freeware apps and utilities which can quickly enhance how the menu bar works. </p>\n<p>And speaking of Freeware, I'll be adding more apps to my macOS Freeware series soon, and the next one will likely be one of my latest obsessions and the tool I am currently using the write my blog posts; <a href=\"https://appflowy.io/\">Appflowy</a>. </p>\n<p>If you have any suggestions for additions to this article or other freeware for macOS please comment below. I read all comments. I don't get many, so it's not hard 🤣</p>\n<p>Thanks for reading!</p>\n<br><br><p></p>\n<br>\n</div>\n",
				"date_published": "2024-05-19T20:36:35-07:00",
				"url": "https://tylerknowsnothing.com/2024/05/19/mastering-the-macos.html",
				"tags": ["apple","howto","featured"]
			},
			{
				"id": "http://tknblogs.micro.blog/2024/04/29/spaced-macos-freeware.html",
				"title": "Spaced | macOS Freeware",
				"content_html": "<p><!-- raw HTML omitted --><!-- raw HTML omitted -->I was a <!-- raw HTML omitted --><!-- raw HTML omitted -->Bartender<!-- raw HTML omitted --><!-- raw HTML omitted --> user for a few years. It was quite nice to get a handle on my Mac&rsquo;s menubar. But I was paying $10 a month for <!-- raw HTML omitted --><!-- raw HTML omitted -->SetApp<!-- raw HTML omitted --><!-- raw HTML omitted --> and access to their library of around 240 applications and utilities. I could have purchased <!-- raw HTML omitted -->Bartender<!-- raw HTML omitted --> for $16 instead, but I didn&rsquo;t. I paid <!-- raw HTML omitted -->SetApp<!-- raw HTML omitted --> $240 for two years to end up using about six apps. <!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<img src=\"https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/11051911310191819445.png\" title=\"Image: https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/11051911310191819445.png\"><p>I was a <a href=\"https://www.macbartender.com/\"><i>Bartender</i></a> user for a few years. It was quite nice to get a handle on my Mac's menubar. But I was paying $10 a month for <a href=\"https://setapp.com/\"><i>SetApp</i></a> and access to their library of around 240 applications and utilities. I could have purchased <i>Bartender</i> for $16 instead, but I didn't. I paid <i>SetApp</i> $240 for two years to end up using about six apps. </p>\n<p>That's not a value in my book.</p>\n\n<!--more-->\n\n<p>So, I cancelled my subscription and started looking for an alternative, and I found it in the form of <a href=\"https://apps.apple.com/us/app/spaced/id1666327168?mt=12\"><i>Spaced, </i></a><a href=\"https://apps.apple.com/us/app/spaced/id1666327168?mt=12\"><i>an entirely free utility available on the App Store</i></a><i>. Now, truth be told, </i><i>Bartender</i><i> is really nothing more than a menubar management tool that makes it easier to put your icons where you want them (mostly, as there are some restrictions imposed by macOS itself), add spacing, and easily hide items. I'm not attempting to diss </i><i>Bartender</i><i>, but it's way more than I need. </i></p>\n<p><i>Spaced</i> really only offers one of the functions of <i>Bartender</i>, adding space, hence the name. Now, macOS already makes it super easy to rearrange your menubar. Just <strong>CMD+Click</strong> on any item and drag it to a new location, excepting the Clock, Siri, and Command Center icons to the far right. </p>\n<p>When <i>Spaced</i><i> is running you won't see it at first as it will appear as a blank space at the left end of your menubar icons. Click that blank space, and you'll get the menu from which you can select a few options as shown below. </i></p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/8238123392149463118.png\" title=\"Image: https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/8238123392149463118.png\"><p>The first thing you'll want to do after installing <i>Spaced</i> and launching it for the first time is go into <strong>Settings... </strong>and turn on <b>Launch at Login</b> so the app starts when your system does. If you end up using one of the visible spacers, you can select the <b>Reduced Opacity</b> option to dim them and make them less... opaque. </p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/17337964712645519506.png\"><p>Following that you can start adding spaces by selecting the New item at the top of the menu. You can choose from a few options as to which kind of space you want to add:</p>\n<ul><li>Space - a single space</li></ul>\n<ul><li>Tab - a wider space</li></ul>\n<ul><li>• - a small bullet</li></ul>\n<ul><li>° - a large bullet </li></ul>\n<ul><li>| - a pipe</li></ul>\n<ul><li>- - a dash</li></ul>\n<ul><li>— - an emdash</li></ul>\n<p>Clicking the <strong>New</strong> item adds another copy of itself on the menubar. You can even click on any one of them and change the space for each spacer at will or add a new spacer. Once you've added a few spaces, you can <strong>CMD+Click</strong> to drag that space into a new position. Then just reorganize your menubar items into groups that are logical to you. I've arranged mine as shown in the following image. </p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/12343643656041559631.png\"><p><i>Spaced</i><i> is a very tidy little app, an applet if you will. It consumes no real CPU power and very little RAM within the context of Macs that can ship with 8GBs of RAM (and I have 16GBs on my M1 Mini 2020) as you can see in the image below. </i></p>\n<img src=\"https://beta.appflowy.cloud/api/file_storage/543ece0e-568b-460d-8c93-b2245886b301/blob/10998942499621838908.png\"><p><strong>PROS</strong></p>\n<ul><li>Simple</li></ul>\n<ul><li>Easy to learn</li></ul>\n<ul><li>Free</li></ul>\n<p><strong>CONS</strong></p>\n<ul><li>The App Store version is only for macOS 14 \"Sonoma\". <a href=\"https://sindresorhus.com/spaced#older-versions\">For an older that works with macOS 13 \"Big Sur\", visit the developers website</a>. </li></ul>\n<h3><strong>CONCLUSION</strong></h3>\n<p>Simply put, this simple app is the simplest invocation of simplicity. It does a single job and does it well, and all without fanfare or added complexity. Spaced may be free, but I find it's utility priceless, and if the developer wants to share their work with others, who am I to say no. <br></p>\n",
				"date_published": "2024-04-29T14:43:45-07:00",
				"url": "https://tylerknowsnothing.com/2024/04/29/spaced-macos-freeware.html",
				"tags": ["apple","freeware","featured"]
			},
			{
				"id": "http://tknblogs.micro.blog/2023/12/14/a-short-horsetale.html",
				"title": "A short horse tale | Short Fiction",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<div class=\"posthaven-post-body\">\n<div><hr></div>\n<div>\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/1067/0*Cdw1Q8AOFS0Nd-8N\" title=\"Image: https://cdn-images-1.medium.com/max/1067/0*Cdw1Q8AOFS0Nd-8N\"><br>\n</div>\n<div>\n<blockquote>MERRY FREAKIN’ CHRISTMAS, that’s craaaaaaaazy lookin’! Photo by <a href=\"https://unsplash.com/@mikael_k?utm_source=medium&utm_medium=referral\" target=\"_blank\">Mikael Kristenson</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\">Unsplash</a>\n</blockquote>\n<p>One day long ago, a horse I was fond of came to me and bit my arm, breaking the skin.</p>\n<p>As blood seeped from the wound I asked, “Why did you bite me.”</p>\n<p>The stallion shook its proud head, stamped its powerful hooves, and whinnied, “Because I can, small human.”</p>\n<p>“That is sad,” I replied.</p>\n\n<!--more-->\n\n<p>The horse said incredulously, “For you maybe, but not for me. Now you ride when <em>I</em> choose. <em>If</em> I choose.”</p>\n<p>“It is sad because I liked you,” I replied, then sprung onto its neck and ripped out its throat with my own teeth, its raging eyes wide with shock and terror. Before the beast could topple over dead, I dropped from the animals neck and stood in the shower of its hot, arterial spray.</p>\n<p>“It’s not size that matters,” I said, wiping viscera from my eyes, “It’s how you use it.”</p>\n</div>\n</div>\n<div><hr></div>\n<div><div>\n<p><em>PS: When I started writing professionally back in 1996 it was with the ultimate goal of writing science fiction. Instead, I ended up working on computer book titles for two decades and dealing with life… like everyone else. I’d been intending to start writing again, but that life thing keeps popping up.</em></p>\n<p><em>So, this is an exercise in writing I thought I’d share. We’ll see if this prompts me to craft more. When writing large projects, it’s important to have an outline and to work on the smallest complete parts you can. Do that every day, and eventually you have a book.</em></p>\n<p><em>Don’t despair. Even in the depths of my depression and the darkest days our little family has faced and will face, I still seem to be able to crack a joke and smile on occasion.</em></p>\n<p><em>That has to be good for something :) -Ed.</em></p>\n</div></div>\n<p></p>\n<br>\n</div>\n",
				"date_published": "2023-12-14T20:16:37-07:00",
				"url": "https://tylerknowsnothing.com/2023/12/14/a-short-horsetale.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2023/12/14/picking-yourself-up.html",
				"title": "“Picking yourself up by your own bootstraps” is stupid.",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<div class=\"posthaven-post-body\">\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/2600/0*v2m_RYwc0gNNGDNw\" title=\"Image: https://cdn-images-1.medium.com/max/2600/0*v2m_RYwc0gNNGDNw\"><br>\n</div>\n<blockquote><div>\n<i>If this were even remotely possible, people would be flying off into space willy nilly. I think, I’m not a scientist. Photo by </i><a href=\"https://unsplash.com/@helloimnik?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Nik</i></a><i> on </i><a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Unsplash</i></a>\n</div></blockquote>\n<div><div>\n<p>What even are bootstraps? I’ll keep this brief. I’m particularly fond of this tidy explainer from <a href=\"https://www.etymonline.com/word/bootstrap\" target=\"_blank\">Etymonline, a language etymology website</a>:</p>\n\n<!--more-->\n\n<blockquote><strong>bootstrap (n.)</strong></blockquote>\n<blockquote>also boot-strap, tab or loop at the back of the top of a men’s boot, which the wearer hooked a finger through to pull the boots on, 1870, from <a href=\"https://www.etymonline.com/word/boot?ref=etymonline_crossreference#etymonline_v_15614\" target=\"_blank\">boot</a> (n.1) + <a href=\"https://www.etymonline.com/word/strap?ref=etymonline_crossreference#etymonline_v_22149\" target=\"_blank\">strap</a> (n.).</blockquote>\n<blockquote>To <strong>pull (oneself) up by (one’s) bootstraps</strong>, by 1871, was used figuratively of an impossible task (among the “practical questions” at the end of chapter one of Steele’s “Popular Physics” schoolbook (1888) is, “30. Why can not a man lift himself by pulling up on his boot-straps?”). But it also is used to suggest “better oneself by rigorous, unaided effort.” The meaning “fixed sequence of instructions to load the operating system of a computer” (1953) is from the notion of the first-loaded program pulling itself (and the rest) up by the bootstrap. It was used earlier of electrical circuits (1946).\n</blockquote>\n<p>Yes, I’m fully aware of the context. The turn of phrase is meant to be a compact epithet that can be tossed at will towards those the tosser casts at persons asking for assistance with getting life off the ground. The Tosser will claim, with wide sweeping motions of their arms, that America is the <em>Land of the Free </em>and <em>Home of the Brave </em>and that all are equal.</p>\n<p><strong><em>NAY</em></strong>, they crow, if you are not a success then you have not engaged in sufficient effort and/or sacrifice. The opportunities are all around us! All you need do is stretch out your hand (and give all of yourself to Capitalism) and take it for yourself. Grab, grab, grab that bootstrap and PULL, and you too can join the ranks of the American Elite!</p>\n<p>Or something to that effect…</p>\n<p>Of course, we’re not stupid, the 99%. We know that’s an open lie. The only equality in America is for the 1% and those whose performative sycophancy allows them to remain in the Amerigarchy’s good graces… at least until they are no longer useful. How many “bodies” has Donny J. left in his wake? There are so many names you could use them for several rounds of Indictment Bingo.</p>\n<p>The reality is that there are roadblocks up everywhere, and those who work to make these hurdles have been doing so for literal decades. Unless you are white and own property, good freakin’ luck, with varying degrees of potential success depending on where your “race” falls on the “Acceptable Immigrants” list. Black and Brown? Just no.</p>\n<p>And you don’t even have to be an immigrant! You can be native-born American BIPOC and <em>still</em> get the same level of “respect” we offer our foreign guests merely seeking to “…breath free”.</p>\n<p>So, yeah. Pulling yourself up by your own bootstraps and all of the similar ideologies is utter bullshit. It’s gaslighting on a National scale.</p>\n<h3>How to fix endemic, structural racism</h3>\n<p>Stop it. Just stop. Stop discriminating. And stop lying about it, as well. It’s one of those open secrets. We all know that’s how it works, so just stop. You’ve been fuckin’ around and found out, as it were.</p>\n<p>You might infer that I’m being glib. I can assure you I am not. There is no way on any version of Earth that a short piece proclaiming the existence of something we all know exists is going to fix our woes. In the end, however, we still need to stop the discrimination.</p>\n<p>The best way to do that is to recognize every human as a human. It’s not that hard. All you have to do is not kill them or make society work any differently for people who may not look exactly like you.</p>\n<p>They’re still people, whether you like it or not.</p>\n</div></div>\n<div><hr></div>\n<div><div>\n<p>For comments, please post one single, simple thing we could all do collectively that would work towards ending discrimination. Think of it from the perspective of a long-term project… because it is.</p>\n<p>A very, very long project.</p>\n</div></div>\n<p></p>\n<br>\n</div>\n",
				"date_published": "2023-12-14T20:13:14-07:00",
				"url": "https://tylerknowsnothing.com/2023/12/14/picking-yourself-up.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2023/12/14/how-to-use.html",
				"title": "How to use an elevator",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<div class=\"posthaven-post-body\">\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/1067/0*OMzsMb7C_Wd0z141\" title=\"Image: https://cdn-images-1.medium.com/max/1067/0*OMzsMb7C_Wd0z141\"><br>\n</div>\n<blockquote><div>\n<i>A bank of elevators in the lobby of a skyscraper. Photo by </i><a href=\"https://unsplash.com/@star7a?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Edwin Chen</i></a><i> on </i><a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Unsplash</i></a>\n</div></blockquote>\n<p>It happens all the time. You’re walking along, getting stuff done, and an elevator comes into the equation. Now what?</p>\n\n<!--more-->\n\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/1067/1*NGkXatx1MW2ug4AUZO6eqA.png\" title=\"Image: https://cdn-images-1.medium.com/max/1067/1*NGkXatx1MW2ug4AUZO6eqA.png\"><br>\n</div>\n<blockquote><div>\n<i>One kind of elevator call button. Any single call button means that you are either at the top or bottom floor. Photo by </i><a href=\"https://unsplash.com/@suicide_chewbacca?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Ashwini Chaudhary(Monty)</i></a><i> on </i><a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Unsplash</i></a>\n</div></blockquote>\n<ol>\n<li>First, breathe. In through the nose, out through the mouth so you focus on doing that instead of thinking. Slow and measured. If your heart is beating fast, breathe deeper than usual, and feel your heart calm. Practice after you exert yourself so you can do it whenever you feel the need.</li>\n<li>If the Call Button is not active, touch it. Do <strong><em>not</em></strong> stand in front of the doors. Triage any other people waiting for an elevator, putting those with fewer mobility options to the front. Don’t be afraid to speak in order to facilitate passenger selection with strangers. It’s highly unlikely that anyone will assault you for this, but remain prepared, just in case.</li>\n<li>When a car arrives at your floor you will hear a bell or electronic chime and a light will appear next to the arriving car. On the ground floor, all cars go up. On the top floor, all cars go down. Any floors between will have both UP and DOWN arrows. One will be lit to indicate which direction the car is heading when a car is at a floor. So, if you want to leave the 11th floor and go to the ground floor of building with fifteen floors, you’d wait for a car to arrive with the DOWN indicator lit. †</li>\n<li>When the doors open, quickly scan the car for any disembarking passengers. If people are exiting, stand aside and allow them safe passage. Your turn will come. If the car is empty and no one else is waiting, feel free to enter.</li>\n<li>After entering the car locate the button panel and select your floor. The panel can be on either side of the doors, or even both. If you are closest to the panel it is customary to ask any other riders which floor they require and then pressing it for them. If nobody performs this role, floor selection is open to all. Step forward and commit.</li>\n<li>Selecting where you will stand depends on how many people are in the car and where you were in the queue to enter. For large loads move to the rear and turn to face the doors. Adjust your position to accommodate any other passengers. In the US, it is highly unusual to engage in social interactions while transiting floors. It is, however, acceptable to make subtle, all-ages jokes to lighten the mood. Do not expect effusive reactions or long conversations.</li>\n<li>Once the doors close and the car is in motion it will move to each selected floor in numerical order, opening and closing the doors to allow people to embark or exit. Try to position yourself in the car with respect to your selected floor. For example, if you are on the 14th floor and other passengers are getting off on lower floors, you can move to the back. This allows others to have more room to maneuver as they engage in the same organizational dance.</li>\n<li>When you reach your floor, disembark.</li>\n</ol>\n<img src=\"https://cdn-images-1.medium.com/max/1067/0*YD4ApROvZGU-NM4M\">Photo by <a href=\"https://unsplash.com/@gbaya123?utm_source=medium&utm_medium=referral\" target=\"_blank\">Gaurav Baya</a> on <a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\">Unsplash</a><p>This may seem like a lot, but there’s no need to worry. The basic rules of operation are easy to get the hang of as long as you practice good elevator etiquette every time you use one. In no time, you’ll get the hang of it.</p>\n<h4>Additional Notes</h4>\n<p>Now, for some tips & tricks to help smooth things out. Don’t worry if you don’t get to use them every time, but these could help make your time in an elevator more pleasurable.</p>\n<p>There are a few buttons in an elevator that perform functions that are not tasked with taking passengers to a floor. Two of the most common are the OPEN and CLOSE buttons and pushing one will cause the doors to behave as instructed. Just be aware that many elevators won’t let you press the OPEN button past a set period of time, after which a buzzer will start to sound a mild alarm as an encouragement to allow the elevator to continue performing its job.</p>\n<blockquote>\n<strong>NOTE</strong>: The OPEN and CLOSE buttons are often depicted as glyphs. The OPEN button looks something like this: <em>[<|>]</em> and the CLOSE button something like this: <em>[>|<].</em>\n</blockquote>\n<blockquote>PROTIP: If you need to keep the door open longer and don’t want the buzzer to admonish you, look for a control labeled HOLD. If there is none, that elevator doesn’t offer the feature. It could be a button or a toggle. You will find this control most commonly in Service Elevators.††</blockquote>\n<p>Did you know that elevator doors know when something or someone will block them from closing? How, you ask? There is a row of lights and light detectors inside the doors on one side, and mirrors inside the other. When any beam of light is broken, the doors stay open! Quite neat, but you can also exploit this. Place your arm across the edge of the door and you will hold it open for other passengers to enter or leave the car.</p>\n<h4>In The Unlikely Event of a Stuck Elevator…</h4>\n<p>Should nobody in the car have a mobile phone or cannot get a signal, most, if not all, elevators have either a phone or an intercom you can use to contact assistance should your elevator car stop moving at an inconvenient time, such as between floors.</p>\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/1067/0*n0gNrzBnCbXIizzJ\"><br>\n</div>\n<blockquote><div>\n<i>An elevator button panel showing the HELP button. I’d never seen one with a “Help is on the way” LED before. Neat. Some have handsets while most just have a speaker grill (likely at the top in the blurry part). Photo by </i><a href=\"https://unsplash.com/@rssemfam?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Russ Ward</i></a><i> on </i><a href=\"https://unsplash.com?utm_source=medium&utm_medium=referral\" target=\"_blank\"><i>Unsplash</i></a>\n</div></blockquote>\n<p>In the immortal words of Douglas Adams, “Don’t panic.”</p>\n<p>First of all, elevators are generally not air-tight, so you won’t run out of air anytime soon. Secondly, use <em>a</em> phone so someone knows where you are. Lastly, stay calm and wait patiently. At most, you’ll have a harrowing tale to tell at dinner.</p>\n<h4>In Conclusion</h4>\n<p>Run through the basics until you get them down. After a few trips on elevators using these methods you’ll get into the swing of things. Here’s a quick break-down to memorize, but after a while this will all become second nature:</p>\n<ul>\n<li>Press any inactive CALL button</li>\n<li>Let anyone already on the elevator out before boarding</li>\n<li>Let those less able to board the car before you</li>\n<li>Hold the door for others as needed</li>\n<li>Be polite</li>\n<li>Get on with your day</li>\n</ul>\n<p>And that’s it! Great work and enjoy your elevator rides from now on!!</p>\n<p>† <i>A car that has been traveling up but has no more calls on higher floors can, after closing the doors, change directions. The doors will then re-open. This works even if you’ve already entered the elevator. You’ll just have to wait for the doors to cycle before you continue.</i></p>\n<p>†† <i>Service Elevators are a special variety of elevator designed to move goods and whatnot to other floors. They are generally far more utilitarian in design so that rough furniture handling doesn’t damage trim pieces or break mirrors.</i></p>\n<p></p>\n<br>\n</div>\n",
				"date_published": "2023-12-14T20:10:26-07:00",
				"url": "https://tylerknowsnothing.com/2023/12/14/how-to-use.html"
			},
			{
				"id": "http://tknblogs.micro.blog/2023/12/14/i-desperately-want.html",
				"title": "I desperately want a lightweight OLED Switch",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->",
				"content_text": "<div class=\"posthaven-post-body\">\n<div>\n<img src=\"https://cdn-images-1.medium.com/max/1067/1*IrNWP5atzP_DlTXDhzZi7A.png\" title=\"Image: https://cdn-images-1.medium.com/max/1067/1*IrNWP5atzP_DlTXDhzZi7A.png\"><br>\n</div>\n<blockquote><div><i>Just make a bigger one, Nintendo.</i></div></blockquote>\n<p>It was a mistake that when I finally bought a Switch, I got a Switch Lite. Sure, it’s a gorgeous indigo blue, but I’m old and the screen is too small. So, I bought an OLED Switch. It was also likely a mistake when instead of returning the Lite, I put it on a shelf and forgot about it. I’d made my new OLED Switch my main, so I’d just forgotten about its little brother.</p>\n\n<!--more-->\n\n<p>A few months back, I was sorting through some stuff and found it. I pulled it out again and stuck in my <em>Mario+Rabbis Kingdom Battle</em> cartridge. I didn’t put it down again for three hours.</p>\n<p>I’ve now found myself picking up the Lite more often, despite the small screen and my old eyes.</p>\n<p>Mario+Rabbids doesn’t have a lot of tiny text, so it’s easy to play on the smaller display. The same goes for most of the popular Nintendo first-party titles like Mario Kart 8 Deluxe, Mario Golf Super Rush, Kirby and The Forgotten Land, Luigi’s Mansion 3, and Captain Toad Treasure Tracker, to mention just a few that I have played on both systems.</p>\n<p>Now, I’ve never played my Switch OLED for longer than an hour and a half. While I do love it, I don’t like everything about it.</p>\n<ul>\n<li>The Joycons are slightly above average, but the ergonomics are definitely the worst among the major console and controller makers offerings. I have a simple TPU slip-on case for the Lite that adds grips. There are no usable options for Joycons that I’ve found. There are loads of 3rd party options, but I shouldn’t have to spend more money to comfortably use the thing I already paid for and they’re all full cases, ungainly in some manner, or ridiculous looking. How hard is it to make snap-on parts for Joycons?</li>\n<li>I don’t play fighting games, but I do hate the Switch D-pad. It’s not even a D-pad, but a copy/paste operation of the A/B/X/Y buttons from the right Joycon. I thought I hated the disc-type the most, but this loose collection of unconnected buttons don’t feel right and sit far too low on the Joycon. It’s annoying. On the other, very awkward hand, the D-pad on the Switch Lite is phenomenal, likely because it’s the same D-pad as the New 3DS.</li>\n<li>The dock is a waste of plastic and I’d not be surprised to find that some people still think it has another processor inside to make the Switch run faster and at higher resolutions when in TV mode. I hate to shatter your fever dream, but no. They could easily reduce it in size by at least 60% and still get the job done. It’s waste and it’s irresponsible and Nintendo can do much better.</li>\n<li>Then there’s the headline; it’s heavy. No, it’s not terribly weighty, but compared to the Lite, it’s a chonker. And all of this extra weight comes from the Switch’s primary functional gimmick, to switch from handheld to console mode. Many parts of the tablet section are made from aluminum, and the Joycon rails are also metal. In stark contrast, the Lite uses an all-plastic shell that has the added benefit of being easily colored, and joycons that are integrated.</li>\n</ul>\n<p>So, here’s what I propose. Easy, really. Just super-size the Lite. A Lite XL, or LL if you hale from another continent, if you will. Make it $269, because that’s a nice price, and stop selling the OG Switch.</p>\n<p>Yeah. That’s pretty much it. Just do that, and we’re fantastic, Nintendo :)</p>\n<p></p>\n<br>\n</div>\n",
				"date_published": "2023-12-14T19:26:43-07:00",
				"url": "https://tylerknowsnothing.com/2023/12/14/i-desperately-want.html",
				"tags": ["editorial"]
			}
	]
}
